fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ДополнительныеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>CatalogRef.ВКМ_ДополнтительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВКМ_ТипыДополнительныхРеквизитов/ВКМ_ТипыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_ТипыДополнительныхРеквизитов</name>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Суммовой</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ДопРеквизитыСозданы = (ВКМ_ДополнительныеРеквизитыПеречень.Количество()>0);
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") 
		И Не ДопРеквизитыСозданы Тогда
			ВКМ_СоздатьДопРеквизиты();
	КонецЕсли;
	УстановитьВидимостьДопРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДопРеквизитов()
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Видимость = Истина;
	Иначе
		Видимость = Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ВКМ_ДополнительныеРеквизитыПеречень Цикл
		Результат = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, Строка.Наименование);
		Если Результат Тогда
    		ЭтотОбъект.Элементы[Строка.Наименование].Видимость = Видимость;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВКМ_СоздатьДопРеквизиты();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВКМ_СоздатьДопРеквизиты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ДополнтительныеРеквизиты.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК Значение,
	|	ЕСТЬNULL(ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.НомерСтроки, 0) КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(ВКМ_ДополнтительныеРеквизиты.Ссылка) КАК ВидПредставление,
	|	ВКМ_ДополнтительныеРеквизиты.ТипРеквизита.Ссылка КАК ТипРеквизита
	|ИЗ
	|	Справочник.ВКМ_ДополнтительныеРеквизиты КАК ВКМ_ДополнтительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК
	|			ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
	|		ПО ВКМ_ДополнтительныеРеквизиты.Ссылка = ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл		
		ДобавитьДополнительныйРеквизит(ДобавляемыеРеквизиты, Выборка);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		ДобавитьПолеДополнительногоРеквизита(Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныйРеквизит(ДобавляемыеРеквизиты, Выборка)
	
	ИмяРеквизита = ИмяРеквизита(Выборка);		
		
	ОписаниеРеквизита = ВКМ_ДополнительныеРеквизитыПеречень.Добавить();
	ОписаниеРеквизита.Наименование = ИмяРеквизита;
	ОписаниеРеквизита.ВидДопИнформации = Выборка.Ссылка;
	
	Если Выборка.ТипРеквизита = Перечисления.ВКМ_ТипыДополнительныхРеквизитов.Дата Тогда
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		ТипНовогоРеквизита = Новый ОписаниеТипов("Дата", , , ,КвалификаторыДаты);
	ИначеЕсли Выборка.ТипРеквизита = Перечисления.ВКМ_ТипыДополнительныхРеквизитов.Суммовой Тогда
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);;
		ТипНовогоРеквизита = Новый ОписаниеТипов("Число",КвалификаторыЧисла);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Неизвестный тип данных у дополнительных реквизитов");
		Возврат;
	КонецЕсли;
	
	
	Реквизит = Новый РеквизитФормы(ИмяРеквизита, 
		ТипНовогоРеквизита,, 
		Выборка.ВидПредставление,
		Истина);
		
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеДополнительногоРеквизита(Выборка)
	
	ИмяРеквизита = ИмяРеквизита(Выборка);
	
	Группа = Элементы.Добавить("Группа_" + ИмяРеквизита, Тип("ГруппаФормы") );//Элементы.ГруппаКонтактнаяИнформация
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = ИмяРеквизита;
	
	ЭтотОбъект[ИмяРеквизита] = Выборка.Значение;
	
КонецПроцедуры

&НаСервере
Функция ИмяРеквизита(Выборка)
	
	Шаблон = "КИ_%1_%2";
	
	ПредставлениеИдентификатора = СтрЗаменить(Выборка.Ссылка.УникальныйИдентификатор(), "-", "");
	
	Возврат СтрШаблон(Шаблон, ПредставлениеИдентификатора, XMLСтрока(Выборка.НомерСтроки));
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВКМ_ДополнительныеРеквизиты.Очистить();
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Для Каждого Строка Из ВКМ_ДополнительныеРеквизитыПеречень Цикл
		
			Если ЗначениеЗаполнено(ЭтотОбъект[Строка.Наименование]) Тогда
				НоваяСтрока = ТекущийОбъект.ВКМ_ДополнительныеРеквизиты.Добавить();
				НоваяСтрока.Значение = ЭтотОбъект[Строка.Наименование];
				НоваяСтрока.Реквизит= Строка.ВидДопИнформации;
		
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
